---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.ColorSettingsType
source: html/c4023701-b18e-63e7-012b-04b53337cdbb.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.ColorSettingsType Property

Stores type of color settings

## Syntax (C#)
```csharp
public AnalysisDisplayStyleColorSettingsType ColorSettingsType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration